Ancien_projet/app/Controllers/Product.php

SELECT *
FROM `product`
---
    public function index() {

        // Instanciation du modèle
        $objProductModel       = new Product_model();

        // On fournit les variables pour la vue
        $data['title']          = "Liste des produits"; // titre
        $data['arrProducts']   = $objProductModel->findAll(); // liste de tous les produits