app/Controllers/Shop.php

	public function boutique($intCat=null){
		//Assignation du titre
		$this->_data['title'] = "Boutique";
		//Instanciation de l'objet entité boutique
		$objShop = new shop_entity;
		//Instanciation de l'objet model boutique
		$objShopModel = new shop_model;
		//vérification si présence du paramètre dans l'URL
		if($intCat != null){
			//Si le paramètre existe, utiliser la fonction findByCat
			$this->_data['products'] = $objShopModel->findByCat($intCat);
		}else{
			//Si le paramètre n'existe pas, utiliser la fonction findAll
			$this->_data['products'] = $objShopModel->findAll();
---
SELECT *
FROM `product`