app/Controllers/Users.php

INSERT INTO `user` (`user_email`, `user_password`) VALUES ('Test@test.fr', 'Test')
---
                $objUsersModel = new Users_model(); // Instanciation du modèle
                $objUsers     = new \App\Entities\Users_entity(); // Instanciation de l'entité
	            $objUsers->fill($this->request->getPost());
                $objUsersModel->save($objUsers); // On sauvegarde l'objet