app/Models/Users_model.php

SELECT *
FROM `user`
WHERE `user_email` = 'dsq'
---
	public function login($arrPost){
		//var_dump($arrPost); die;
		$password = $arrPost['user_password'];
		$mail = $arrPost['user_email'];
		$userconnect = $this->where("user_email", $mail, "user_password", $password)->find();